
## Plan Result (prod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 11 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_monitor_action_group.pre-support[0]
  * azurerm_monitor_metric_alert.postgres_alert_active_connections[0]
  * azurerm_monitor_metric_alert.postgres_alert_cpu[0]
  * azurerm_monitor_metric_alert.postgres_alert_failed_connections[0]
  * azurerm_monitor_metric_alert.postgres_alert_memory[0]
  * azurerm_monitor_metric_alert.postgres_alert_storage_utilization[0]
  * azurerm_monitor_metric_alert.storage_final_alert_capacity[0]
  * azurerm_monitor_metric_alert.storage_ingest_alert_capacity[0]
  * module.backup_vault[0].azurerm_data_protection_backup_vault.this
  * module.data_gateway_vm[0].azurerm_windows_virtual_machine.winvm[0]
  * module.data_gateway_vm[1].azurerm_windows_virtual_machine.winvm[0]
* Replace
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/css/govuk-frontend-5.2.0.min.css&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/css/main.css&#34;]
  * azurerm_storage_blob.b2c_config[&#34;b2c/views/js/b2c.js&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_monitor_action_group.pre-support[0] will be updated in-place
  ~ resource "azurerm_monitor_action_group" "pre-support" {
        id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/actionGroups/CriticalAlertsAction"
        name                = "CriticalAlertsAction"
      ~ tags                = {
          - "application"  = "pre-recorded-evidence" -> null
          - "builtFrom"    = "https://github.com/HMCTS/pre-network.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_monitor_metric_alert.postgres_alert_active_connections[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "postgres_alert_active_connections" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/postgres_active_connections_greater_than_80_percent"
        name                     = "postgres_active_connections_greater_than_80_percent"
      ~ tags                     = {
          - "application"  = "pre-recorded-evidence" -> null
          - "builtFrom"    = "https://github.com/HMCTS/pre-network.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_metric_alert.postgres_alert_cpu[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "postgres_alert_cpu" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/postgres_cpu_percent_95"
        name                     = "postgres_cpu_percent_95"
      ~ tags                     = {
          - "application"  = "pre-recorded-evidence" -> null
          - "builtFrom"    = "https://github.com/HMCTS/pre-network.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_metric_alert.postgres_alert_failed_connections[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "postgres_alert_failed_connections" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/postgres_failed_connections_greater_than_10"
        name                     = "postgres_failed_connections_greater_than_10"
      ~ tags                     = {
          - "application"  = "pre-recorded-evidence" -> null
          - "builtFrom"    = "https://github.com/HMCTS/pre-network.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_metric_alert.postgres_alert_memory[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "postgres_alert_memory" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/postgres_memory_percent_95"
        name                     = "postgres_memory_percent_95"
      ~ tags                     = {
          - "application"  = "pre-recorded-evidence" -> null
          - "builtFrom"    = "https://github.com/HMCTS/pre-network.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_metric_alert.postgres_alert_storage_utilization[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "postgres_alert_storage_utilization" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/postgres_storage_utilization_90"
        name                     = "postgres_storage_utilization_90"
      ~ tags                     = {
          - "application"  = "pre-recorded-evidence" -> null
          - "builtFrom"    = "https://github.com/HMCTS/pre-network.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_metric_alert.storage_final_alert_capacity[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_final_alert_capacity" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/used_capacity"
        name                     = "used_capacity"
      ~ scopes                   = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preingestsaprod",
          + "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prefinalsaprod",
        ]
      ~ tags                     = {
          - "application"  = "pre-recorded-evidence" -> null
          - "builtFrom"    = "https://github.com/HMCTS/pre-network.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_monitor_metric_alert.storage_ingest_alert_capacity[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_ingest_alert_capacity" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/used_capacity"
        name                     = "used_capacity"
      ~ tags                     = {
          - "application"  = "pre-recorded-evidence" -> null
          - "builtFrom"    = "https://github.com/HMCTS/pre-network.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/css/govuk-frontend-5.2.0.min.css"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "cef2b8e4bfd9cfbf1d910f10d7b23a11" -> "de9cc2127dd5a03ed66338406cf6c276" # forces replacement
      ~ content_type           = "text/css" -> "application/octet-stream"
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "css/govuk-frontend-5.2.0.min.css"
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/css/main.css"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "faf1d82a676a2cd91f581505932a9acf" -> "9b303a389078a71c9f52e7f58f90e510" # forces replacement
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/css/main.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "css/main.css"
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/css/main.css" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["b2c/views/js/b2c.js"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "42ee13b169d48b9ee970230b8bf09afc" -> "ab1337886ec4d6f49ae584394527f2ef" # forces replacement
      ~ id                     = "https://presaprod.blob.core.windows.net/pre-b2c-container/js/b2c.js" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "js/b2c.js"
      ~ url                    = "https://presaprod.blob.core.windows.net/pre-b2c-container/js/b2c.js" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.backup_vault[0].azurerm_data_protection_backup_vault.this will be updated in-place
  ~ resource "azurerm_data_protection_backup_vault" "this" {
        id                         = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.DataProtection/backupVaults/pre-backup-vault-prod"
        name                       = "pre-backup-vault-prod"
      ~ tags                       = {
          - "application"  = "pre-recorded-evidence" -> null
          - "builtFrom"    = "https://github.com/HMCTS/pre-network.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_gateway_vm[0].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Compute/virtualMachines/dg-vm1-prod"
        name                                                   = "dg-vm1-prod"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (41 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_gateway_vm[1].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Compute/virtualMachines/dg-vm2-prod"
        name                                                   = "dg-vm2-prod"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (41 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 11 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":805,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->